In [6]:
import pandas as pd

# 데이퍼프레임 생성
friend_dict_list= [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'},
    {'name':'Jenny','age':30,'job':'developer'}
]
df = pd.DataFrame(friend_dict_list)

In [8]:
df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [33]:
# 행(row) 인덱싱 1
print(df[0:2])

# 행(row) 인덱싱 2
print(df.loc[0:1])

   name  age      job
0  John   25  student
1  Nate   30  teacher
   name  age      job
0  John   25  student
1  Nate   30  teacher

In [27]:
# 특정행 접근
df.loc[[0,2]]

    name  age        job
0   John   25    student
2  Jenny   30  developer

In [18]:
# 열(col) filter
df['name']

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [47]:
# 여러개 열(col) filter
df[['name','age']]

    name  age
0   John   25
1   Nate   30
2  Jenny   30

In [35]:
# column 조건 filter 1
df[df.age > 25]

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [46]:
# column 조건 filter 2
df[df.job == "teacher"]

   name  age      job
1  Nate   30  teacher

In [39]:
# 다중 조건, 논리 연산자를 기준으로 () 로 블락해야한다.
df[(df.age > 25) & (df.name =="Nate")]

   name  age      job
1  Nate   30  teacher

In [40]:
friend_dict_list= [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'},
    {'name':'Jenny','age':30,'job':'developer'}
]

df = pd.DataFrame(friend_dict_list)

In [41]:
# iloc[row,col] 
# row : 행(row) 접근
# col : 열(col) 접근
# 전체 인덱싱
df.iloc[:,]

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [44]:
# column 인덱싱
df.iloc[:,0:2]

    name  age
0   John   25
1   Nate   30
2  Jenny   30

In [43]:
# row 인덱싱
df.iloc[0:2,:]

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [45]:
df.iloc[0:2,0:2]

   name  age
0  John   25
1  Nate   30

In [51]:
# filter methods 1
# axis = 1 : column 기준
df.filter(items=['age','job'],axis=1)

   age        job
0   25    student
1   30    teacher
2   30  developer

In [52]:
# filter methods 2
# column name에 a 가 들어간 column 불러오기
df.filter(like='a',axis=1)

    name  age
0   John   25
1   Nate   30
2  Jenny   30